/*
	ReadIMX.dll
	(c) LaVision
	TL 10.05.01: reading IMG/IMX/VEC raw data
	TL 11.06.01: added reading of string attributes
	TL 30.09.02: corrected mis-aligned image_header for Linux
	TL 05.02.04: support IM7/VC7 on WIN32
	TL 22.03.04: BufferScaleType and reading of scaling information
	TL 09.07.04: DestroyBuffer
	TL 08.12.04: LabView functions
	TL 13.12.04: WriteIMG
	TL 18.02.05: DestroyAttributeList
	TL 20.09.05: WriteIMX
	TL 07.03.06: LabView functions to write number of frame
	TL 02.11.06: Labiew functions remember the attribute list, WriteImgAttributes
	TL 16.02.09: ReadIM7 with 12 bit compression

	Read a LaVision IMX/IMG/VEC file by a call to:

	extern "C" int EXPORT ReadIMX ( const char* theFileName, BufferType* myBuffer, AttributeList** myList )

	If you don't want to read the attributes, set myList = NULL. 
	If myList is set, the parameter returns a pointer to the list. 
	You have to free the strings manually or call DestroyAttributeList.

	The function returns the error codes of ImReadError_t.
*/

#include "ReadIMX.h"

#ifdef _LINUX
#	define max(v1,v2)	(v1 > v2 ? v1 : v2)
#else // Windows
	// TL 21.04.09: strcpy_s Warnungen weg
#	pragma warning (disable : 4996)
#endif


/*****************************************************************************/
// General functions and header (image_header) of IMG/IMX/VEC files
/*****************************************************************************/

#ifdef _WIN32

#	ifdef __BORLANDC__
#		pragma option -a1
#	else
#		pragma pack (1)
#	endif

#endif


typedef struct		// image file header (256 Bytes)
	{
	 short int 	imagetype;      // 0:  (Image_t)
	 short int	xstart;			// 2:  start-pos left, not used
	 short int	ystart;			// 4:  start-pos top, not used
	 Byte			extended[4];// 6:  reserved
	 short int	rows;			// 10: total number of rows, if -1 the real number is stored in longRows
	 short int	columns;		// 12: total number of columns, if -1 see longColumns
	 short int  image_sub_type; // 14: type of image (int):
								//				(included starting from sc_version 4.2 on)
								// 	0 = normal image
								//		1 = PIV vector field with header and 4*2D field
								//				rows = 9 * y-size
								//		2 = simple 2D vector field (not used yet)
								//				rows = 2 * y-size
								//		3 ...
	 short int 	y_dim;			// 16: size of y-dimension (size of x-dimension is always = columns), not used
	 short int 	f_dim;			// 18: size of f-dimension (number of frames)

	 // for image_sub_type 1/2 only:
	 short int	vector_grid; 	// 20: 1-n = vector data: grid size
								//     		(included starting from sc_version 4.2 on)
	 char			ext[11];	// 22: reserved
	 Byte			version;	// 33:  e.g. 120 = 1.2	300+ = 3.xx  40-99 = 4.0 bis 9.9
#ifdef _WIN32
	 char       date[9];        // 34	
	 char       time[9];		// 43
#else
//#message MIS-ALIGNED!!!
	 char       date[8];        // 34	
	 char       time[8];		// 43
#endif
	 short int  xinit;          // 52:  x-scale values
    float       xa;             // 54
    float       xb;             // 58
    char        xdim[11];       // 62
    char        xunits[11];     // 73
	 short int  yinit;          // 84:  y-scale values
    float       ya;             // 86
    float       yb;             // 90
    char        ydim[11];       // 94
    char        yunits[11];     // 105
	 short int  iinit;          // 116: i-scale (intensity) values
    float       ia;             // 118
    float       ib;             // 122
    char        idim[11];       // 126
    char        iunits[11];     // 137

	 char       com1[40];       // 148: comment (2 lines)
	 char       com2[40];		// 188

	 int		longRows;	    // 228: (large) number of rows, TL 04.02.2000
	 int		longColumns;    // 232: (large) number of columns, TL 04.02.2000
     int		longZDim;		// 236: (large) number of z-dimension, TL 02.05.00
	 char		reserved[12];   // 240: reserved
	 int		checksum;	    // 252-255: not used
	} image_header;


#ifdef __BORLANDC__
#	pragma option -a.
#else
#	pragma pack ()
#endif


#define VER_EXTHEADER			54
#define VER_VOLUME_BUFFER		55


extern "C" void EXPORT SetBufferScale( BufferScaleType* theScale, float theFactor, float theOffset, const char* theDesc, const char* theUnit )
{
	if (theScale)
	{
		theScale->factor	= theFactor;
		theScale->offset	= theOffset;
		strncpy( theScale->description, theDesc, sizeof(theScale->description) );
		theScale->description[sizeof(theScale->description)-1] = 0;
		strncpy( theScale->unit, theUnit, sizeof(theScale->unit) );
		theScale->unit[sizeof(theScale->unit)-1] = 0;
	}
}


